anol/Explore_ECR_Topics/src/Variant/Platform/Platform_MCXA/drivers/fsl_lpuart.c
static void LPUART_TransferHandleReceiveDataFull(LPUART_Type *base, lpuart_handle_t *handle)
{
    uint8_t count;
    uint8_t tempCount;
    uint16_t tpmRxRingBufferHead;
    uint32_t tpmData;
    uint32_t irqMask;

    /* Get the size that can be stored into buffer for this interrupt. */
#if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
    count = ((uint8_t)((base->WATER & LPUART_WATER_RXCOUNT_MASK) >> LPUART_WATER_RXCOUNT_SHIFT));
#else
    count = 1;
#endif

    /* If handle->rxDataSize is not 0, first save data to handle->rxData. */
    while ((0U != handle->rxDataSize) && (0U != count))
    {
#if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
        tempCount = (uint8_t)MIN(handle->rxDataSize, count);
#else
        tempCount = 1;
#endif

        /* Using non block API to read the data from the registers. */
        if (!handle->is16bitData)
        {
            LPUART_ReadNonBlocking(base, handle->rxData, tempCount);
            handle->rxData = &handle->rxData[tempCount];
        }
        else
        {
            LPUART_ReadNonBlocking16bit(base, handle->rxData16, tempCount);
            handle->rxData16 = &handle->rxData16[tempCount];
        }
        handle->rxDataSize -= tempCount;
        count -= tempCount;

        /* If all the data required for upper layer is ready, trigger callback. */
        if (0U == handle->rxDataSize)
        {
            handle->rxState = (uint8_t)kLPUART_RxIdle;

            if (NULL != handle->callback)
            {
                handle->callback(base, handle, kStatus_LPUART_RxIdle, handle->userData);
            }
        }
    }

    /* If use RX ring buffer, receive data to ring buffer. */
    if (NULL != handle->rxRingBuffer)
    {
        while (0U != count--)
        {
            /* If RX ring buffer is full, trigger callback to notify over run. */
            if (LPUART_TransferIsRxRingBufferFull(base, handle))
            {
                if (NULL != handle->callback)
                {
                    handle->callback(base, handle, kStatus_LPUART_RxRingBufferOverrun, handle->userData);
                }
            }

            /* If ring buffer is still full after callback function, the oldest data is overridden. */
            if (LPUART_TransferIsRxRingBufferFull(base, handle))
            {
                /* Increase handle->rxRingBufferTail to make room for new data. */
                if (((uint32_t)handle->rxRingBufferTail + 1U) == handle->rxRingBufferSize)
                {
                    handle->rxRingBufferTail = 0U;
                }
                else
                {
                    handle->rxRingBufferTail++;
                }
            }

            /* Read data. */
            tpmRxRingBufferHead = handle->rxRingBufferHead;
            tpmData             = base->DATA;
#if defined(FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT) && FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT
            if (handle->isSevenDataBits)
            {
                handle->rxRingBuffer[tpmRxRingBufferHead] = (uint8_t)(tpmData & 0x7FU);
            }
            else
            {
                if (!handle->is16bitData)
                {
                    handle->rxRingBuffer[tpmRxRingBufferHead] = (uint8_t)tpmData;
                }
                else
                {
                    handle->rxRingBuffer16[tpmRxRingBufferHead] = (uint16_t)(tpmData & 0x3FFU);
                }
            }
#else
            if (!handle->is16bitData)
            {
                handle->rxRingBuffer[tpmRxRingBufferHead] = (uint8_t)tpmData;
            }
            else
            {
                handle->rxRingBuffer16[tpmRxRingBufferHead] = (uint16_t)(tpmData & 0x3FFU);
            }
#endif

            /* Increase handle->rxRingBufferHead. */
            if (((uint32_t)handle->rxRingBufferHead + 1U) == handle->rxRingBufferSize)
            {
                handle->rxRingBufferHead = 0U;
            }
            else
            {
                handle->rxRingBufferHead++;
            }
        }
    }
    /* If no receive requst pending, stop RX interrupt. */
    else if (0U == handle->rxDataSize)
    {
        /* Disable and re-enable the global interrupt to protect the interrupt enable register during
         * read-modify-wrte. */
        irqMask = DisableGlobalIRQ();
        base->CTRL &= ~(uint32_t)(LPUART_CTRL_RIE_MASK | LPUART_CTRL_ORIE_MASK | LPUART_CTRL_ILIE_MASK);
        EnableGlobalIRQ(irqMask);
    }
    else
    {
        /* Avoid MISRA C-2012 15.7 voiation */
        return;
    }
}

static void LPUART_TransferHandleSendDataEmpty(LPUART_Type *base, lpuart_handle_t *handle)
{
    uint8_t count;
    uint8_t tempCount;
    uint32_t irqMask;
/* Get the bytes that available at this moment. */
#if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
    count = (uint8_t)FSL_FEATURE_LPUART_FIFO_SIZEn(base) -
            (uint8_t)((base->WATER & LPUART_WATER_TXCOUNT_MASK) >> LPUART_WATER_TXCOUNT_SHIFT);
#else
    count = 1;
#endif

    while ((0U != handle->txDataSize) && (0U != count))
    {
#if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
        tempCount = (uint8_t)MIN(handle->txDataSize, count);
#else
        tempCount = 1;
#endif

        /* Using non block API to write the data to the registers. */
        if (!handle->is16bitData)
        {
            LPUART_WriteNonBlocking(base, handle->txData, tempCount);
            handle->txData = &handle->txData[tempCount];
        }
        else
        {
            LPUART_WriteNonBlocking16bit(base, handle->txData16, tempCount);
            handle->txData16 = &handle->txData16[tempCount];
        }
        handle->txDataSize -= tempCount;
        count -= tempCount;

        /* If all the data are written to data register, notify user with the callback, then TX finished. */
        if (0U == handle->txDataSize)
        {
            /* Disable and re-enable the global interrupt to protect the interrupt enable register during
             * read-modify-wrte. */
            irqMask = DisableGlobalIRQ();
            /* Disable TX register empty interrupt and enable transmission completion interrupt. */
            base->CTRL = (base->CTRL & ~LPUART_CTRL_TIE_MASK) | LPUART_CTRL_TCIE_MASK;
            EnableGlobalIRQ(irqMask);
        }
    }
}

static void LPUART_TransferHandleTransmissionComplete(LPUART_Type *base, lpuart_handle_t *handle)
{
    uint32_t irqMask;
    /* Set txState to idle only when all data has been sent out to bus. */
    handle->txState = (uint8_t)kLPUART_TxIdle;

    /* Disable and re-enable the global interrupt to protect the interrupt enable register during read-modify-wrte.
     */
    irqMask = DisableGlobalIRQ();
    /* Disable transmission complete interrupt. */
    base->CTRL &= ~(uint32_t)LPUART_CTRL_TCIE_MASK;
    EnableGlobalIRQ(irqMask);

